benchmark/benchmark-result-2025-12-26/sleep_0ms_no_special_vars/no-keep-alive/hunchentoot-recycling-taskmaster_threads-8-default.log
hunchentoot-recycling-taskmaster_threads-8-default.log
HUNCHENTOOT-RECYCLING-TASKMASTER	0.0.1

LISP-IMPLEMENTATION-TYPE   	SBCL                               
LISP-IMPLEMENTATION-VERSION	2.2.9.debian                       
MACHINE-TYPE               	X86-64                             
MACHINE-VERSION            	13th Gen Intel(R) Core(TM) i7-1360P
SOFTWARE-TYPE              	Linux                              
SOFTWARE-VERSION           	5.15.153.1-microsoft-standard-WSL2 
*handler-sleep-seconds*	0.001

# -H Connection: close -t 4 -c 100 -d 10 http://localhost:4242/yo 
Running 10s test @ http://localhost:4242/yo
  4 threads and 100 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     5.59ms   29.93ms 888.23ms   98.72%
    Req/Sec     4.32k     1.05k    7.02k    67.83%
  172330 requests in 10.10s, 27.28MB read
Requests/sec:  17064.18
Transfer/sec:      2.70MB

# -H Connection: close -t 4 -c 10 -d 10 http://localhost:4242/yo 
Running 10s test @ http://localhost:4242/yo
  4 threads and 10 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   614.65us  473.61us  12.59ms   95.97%
    Req/Sec     2.42k   210.35     3.04k    74.50%
  96166 requests in 10.00s, 15.22MB read
Requests/sec:   9611.96
Transfer/sec:      1.52MB

# -H Connection: close -t 16 -c 400 -d 10 http://localhost:4242/yo 
Running 10s test @ http://localhost:4242/yo
  16 threads and 400 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    37.17ms  168.09ms   1.92s    95.48%
    Req/Sec     0.95k   668.25     7.90k    74.57%
  139856 requests in 10.10s, 22.14MB read
  Socket errors: connect 0, read 0, write 0, timeout 25
Requests/sec:  13845.17
Transfer/sec:      2.19MB