benchmark/benchmark-result-2025-12-26/sleep_0ms_no_special_vars/no-keep-alive/hunchentoot_default.log
hunchentoot_default.log
HUNCHENTOOT	1.3.1

LISP-IMPLEMENTATION-TYPE   	SBCL                               
LISP-IMPLEMENTATION-VERSION	2.2.9.debian                       
MACHINE-TYPE               	X86-64                             
MACHINE-VERSION            	13th Gen Intel(R) Core(TM) i7-1360P
SOFTWARE-TYPE              	Linux                              
SOFTWARE-VERSION           	5.15.153.1-microsoft-standard-WSL2 
*handler-sleep-seconds*	0.001

# -H Connection: close -t 4 -c 100 -d 10 http://localhost:4242/yo 
Running 10s test @ http://localhost:4242/yo
  4 threads and 100 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    13.07ms   36.33ms 888.48ms   98.66%
    Req/Sec     1.33k   529.14     2.79k    70.00%
  53063 requests in 10.07s, 8.40MB read
Requests/sec:   5271.26
Transfer/sec:    854.52KB

# -H Connection: close -t 4 -c 10 -d 10 http://localhost:4242/yo 
Running 10s test @ http://localhost:4242/yo
  4 threads and 10 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     1.39ms  537.27us  11.08ms   80.70%
    Req/Sec     1.35k   149.86     1.64k    76.25%
  53897 requests in 10.01s, 8.53MB read
Requests/sec:   5383.77
Transfer/sec:      0.85MB

# -H Connection: close -t 16 -c 400 -d 10 http://localhost:4242/yo 
Running 10s test @ http://localhost:4242/yo
  16 threads and 400 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    28.25ms  126.33ms   1.78s    97.15%
    Req/Sec   357.82    252.87     3.25k    72.96%
  50958 requests in 10.07s, 8.07MB read
  Socket errors: connect 0, read 0, write 0, timeout 10
Requests/sec:   5059.49
Transfer/sec:    820.19KB